// Keyboard HID (handsfree) panel
"MSG_TYPE_PASSKEY" = "Digite o código que se segue e carregue em Return no teclado.";

"MSG_PAIRING_TIMEOUT" = "Não foi possível emparelhar com “%@”. Clique em Emparelhar para voltar a tentar.";
"MSG_PAIRING_TIMEOUT_AUTO" = "Não foi possível emparelhar com “%@”. Dentro de 5 segundo será efectuada uma tentativa de emparelhamento com o teclado seguinte.";
"MSG_PAIRING_TIMEOUT_AUTO_LAST" = "Não foi possível emparelhar com “%@”. Será efectuada uma nova tentativa dentro de 5 segundos.";

"MSG_PAIRING_FAILED" = "Não foi possível emparelhar o teclado. Clique em Emparelhar para voltar a tentar.";
"MSG_PAIRING_FAILED_AUTO" = "Não foi possível emparelhar o teclado. A tentar novamente…";

// Discovery Panel (General)
"kDiscovery_Gen_ErrorOccurredSearchingKey" = "Ocorreu um problema ao procurar os seus dispositivos sem fios.";


//getPairingWithDeviceTitle;
"TITLE_PAIRING_WITH_YOUR_KEYBOARD" = "A emparelhar com o teclado “%@”.";
"TITLE_PAIRING_WITH_YOUR_MOUSE" = "A emparelhar com o rato “%@”.";

//getSearchingForDeviceTitle;
"TITLE_SEARCHING_FOR_YOUR_KEYBOARD" = "A procurar o teclado…";
"TITLE_SEARCHING_FOR_YOUR_MOUSE" = "A procurar o rato…";

//getDevicePairedTitle
"TITLE_PAIRED_KEYBOARD" = "O emparelhamento de “%@” com o seu computador foi bem sucedido.";
"TITLE_PAIRED_MOUSE" = "O emparelhamento de “%@” com o seu computador foi bem sucedido.";

//getNFoundTitle
"TITLE_KEYBOARD_N_FOUND" = "O Assistente de Configuração encontrou %d teclados sem fios.";
"TITLE_MOUSE_N_FOUND" = "O Assistente de Configuração encontrou %d ratos sem fios.";

//getFoundTitle
"TITLE_KEYBOARD_FOUND" = "O Assistente de Configuração encontrou o teclado “%@”.";
"TITLE_MOUSE_FOUND" = "O Assistente de Configuração encontrou o rato “%@”.";

//getMessageStartPairing
"MSG_START_PAIRING_KEYBOARD" = "Seleccione o teclado na lista, depois clique em Emparelhar. Quando o emparelhamento estiver concluído, verá um código de acesso que terá de digitar no teclado.";
"MSG_START_PAIRING_MOUSE" = "O Assistente de Configuração está a tentar emparelhar cada rato da lista. Quando o seu rato ficar emparelhado, é possível deslocar o ponteiro com o rato.";

//getMessageStartPairingSingle
"MSG_START_PAIRING_KEYBOARD_SINGLE" = "O emparelhamento com “%@” inicia-se automaticamente. Quando o teclado estiver emparelhado, verá um código de acesso que tem de digitar.";
"MSG_START_PAIRING_MOUSE_SINGLE" = "O emparelhamento com “%@” inicia-se automaticamente. Quando o rato estiver emparelhado, pode deslocar o ponteiro.";

//getMessageDeviceNotFound
"MSG_KEYBOARDS_NOT_FOUND_SO_FAR" = "Não foi encontrado nenhum teclado. A procurar…";
"MSG_MOUSE_NOT_FOUND_SO_FAR" = "Não foi encontrado nenhum rato. A procurar…";

//getMessageNoDevice
"MSG_NO_KEYBOARD" = "Não há nenhum teclado ligado ao seu computador. Ligue um teclado.";
"MSG_NO_MOUSE" = "Não há nenhum rato ligado ao seu computador. Ligue um rato.";

//getMessageNoDeviceBT
"MSG_NO_KEYBOARD_BLUETOOTH"	= "Não há nenhum teclado ligado ao seu computador. Ligue um teclado.\n\nSe está a usar um teclado Apple sem fios, certifique-se de que as pilhas foram correctamente inseridas e de que o teclado está ligado.";
"MSG_NO_MOUSE_BLUETOOTH" = "Não há nenhum rato ligado ao seu computador. Ligue um rato.\n\nSe está a usar um rato Apple sem fios, deslize a tampinha que se encontra na parte de baixo do rato para o activar e abrir o LED.\n\nSe não usa rato, ligue o teclado.";

//getMessageGettingDeviceName
"MSG_GETTING_KEYBOARD_NAMES" = "A actualizar %d nomes de teclados...";
"MSG_GETTING_MOUSE_NAMES" = "A actualizar %d nomes de ratos...";

//getMessageWaitingForAcknowlegement
"MSG_WAITING_FOR_KEYBOARD_ACKNOWLEGEMENT" = "Para reconhecer o emparelhamento, prima a tecla Return do teclado. Se não o fizer, o emparelhamento volta a iniciar daqui a %d segundos.";
"MSG_WAITING_FOR_MOUSE_ACKNOWLEGEMENT" = "Para reconhecer o emparelhamento, use o rato para clicar em OK. Se não o fizer, o emparelhamento volta a iniciar daqui a %d segundos.";

//getMessageAuthenticationFailure
"MSG_AUTH_FAILURE_KEYBOARD" = "O código que digitou não está correcto. Clique em Emparelhar para voltar a tentar.";
"MSG_AUTH_FAILURE_MOUSE" = "O emparelhamento do rato não foi bem sucedido. Clique em Emparelhar para voltar a tentar.";

//getMessageAuthenticationFailureAuto
"MSG_AUTH_FAILURE_KEYBOARD_AUTO" = "O código que digitou não está correcto. Será efectuada uma nova tentativa de emparelhamento com o teclado dentro de 5 segundos.";
"MSG_AUTH_FAILURE_MOUSE_AUTO" = "O emparelhamento do rato não foi bem sucedido. Será feita outra tentativa dentro de 5 segundos.";

//getMessageAlreadyPaired
"MSG_ALREADY_PAIRED_KEYBOARD" = "A aguardar que seja estabelecida ligação com o teclado…";
"MSG_ALREADY_PAIRED_MOUSE" = "Clique com o rato, para começar a usá-lo.";

// ** WARNINGS **
//getWarningPairingSingle
"MSG_WARNING_PAIRING_MOUSE_SINGLE" = "Se este não for o seu rato, certifique-se de que o seu rato está ligado. Depois, aguarde até que a procura volte a ser iniciada.";
"MSG_WARNING_PAIRING_KEYBOARD_SINGLE" = "Se este não for o seu teclado, certifique-se de que o seu teclado está ligado. Depois, aguarde até que a procura volte a ser iniciada.";

//getWarningPairing 
"MSG_WARNING_PAIRING_MOUSE" = "Se o seu rato não constar da lista, certifique-se de que está ligado. Clique em Cancelar para voltar a procurar.";
"MSG_WARNING_PAIRING_KEYBOARD" = "Se o seu teclado não constar da lista, certifique-se de que está ligado. Clique em Cancelar para voltar a procurar.";

//getWarningAcknowlegement
"MSG_WARNING_ACK_MOUSE" = "Se o ponteiro não se deslocar ao mover o rato, é porque este não está emparelhado com o computador. Aguarde até que o emparelhamento volte a iniciar.";
"MSG_WARNING_ACK_KEYBOARD" = "Se, depois de carregar na tecla Return, o teclado não reconhecer o emparelhamento, é porque não está emparelhado com o computador. Aguarde até que o emparelhamento volte a iniciar.";

// ** PAIRING STATUS **
//getMessagePairingStarting
"MSG_PAIRING_STARTING" = "A emparelhar com o dispositivo…";

//getMessagePairingConnectingToDevice
"MSG_PAIRING_CONNECTING" = "A estabelecer ligação…";

//getMessagePairingConnectionEstablished
"MSG_PAIRING_CONNECTION_ESTABLISHED" = "Ligado.";

//getMessagePairingConnectionComplete
"MSG_PAIRING_COMPLETE" = "O emparelhamento está concluído.";

"CUSTOM_MOUSE_NAME"	= "Rato %@";
"CUSTOM_KEYBOARD_NAME"	= "Teclado %@";

